#+CONSTANTS: oldFTP=267
#+CONSTANTS: currentFTP=267

** General Build
*** Week 0

    | Day | Type | Set   | Rest | SubSet | SubSet Ins | Rest | Instruction                  |
    |-----+------+-------+------+--------+------------+------+------------------------------|
    | 0   | FTP  | -     |      | -      | -          | -    | -                            |
    | 1   | UDF  | -     | -    | -      | -          | -    | 90m                          |
    | 2   | INT  | 7x5m  | 292  | -      | -          | 5m   | constant                     |
    | 3   | UDF  | -     | -    | -      | -          | -    | 75m                          |
    | 4   | INT  | 6x9m  | @R6  | 3x3m   | -          | 6m   | 1 (easy)+ 1 (full) +1 (easy) |
    | -   | -    | -     | -    | -      | 256        | -    | see problem to solve         |
    | -   | -    | -     | -    | -      | 267        | -    | -                            |
    | -   | -    | -     | -    | -      | 270        | -    | -                            |
    | 5   | INT  | 3x20m | -    | -      | -          | 15m  | inbetween set diff           |
    | -   | -    | -     | 238  | -      | -          | -    | -                            |
    | -   | -    | -     | 248  | -      | -          | -    | -                            |
    | -   | -    | -     | 240  | -      | -          | -    | -                            |
    #+TBLFM: @4$4=$currentFTP * 1.08;%.0f
    #+TBLFM: @11$4=$currentFTP * 0.88;%.0f
    #+TBLFM: @12$4=$currentFTP * 0.92;%.0f
    #+TBLFM: @13$4=$currentFTP * 0.89;%.0f
    #+TBLFM: @7$6=$currentFTP * 0.95;%.0f
    #+TBLFM: @8$6=$currentFTP * (1.1 -0.95) / 4 + $currentFTP * 0.95;%.0f
    #+TBLFM: @9$6=$currentFTP * (1.1 -0.95) / 3 + $currentFTP * 0.95;%.0f

*** Week 1

    | Day | Type | Set   | Rest | SubSet | SubSet Ins | Rest | Instruction        |
    |-----+------+-------+------+--------+------------+------+--------------------|
    | 0   | INT  | 3     | -    | -      |          - | -    | -                  |
    | -   | -    | -     | 6m   | 4x2m   |          - | 3m   | 2nd 3 sub set      |
    | -   | -    | -     | -    | ->45s  |        252 | -    | -                  |
    | -   | -    | -     | -    | ->25s  |         -3 | -    | decrease           |
    | -   | -    | -     | -    | -      |        310 | -    | -                  |
    | 1   | UDF  | -     | -    | -      |          - | -    | 90m                |
    | 2   | INT  | 8x5m  | -    | 288    |          - | 5m   | constant           |
    | 3   | UDF  | -     | -    | -      |          - | -    | 60m                |
    | 4   | INT  | 7x8m  | 5.5m | 2x4m   |          - | -    | -                  |
    | -   | -    | -     | -    | -      |        200 | -    | -                  |
    | -   | -    | -     | -    | -      |        205 | -    | -                  |
    | -   | -    | -     | -    | -      |        267 | -    | -                  |
    | -   | -    | -     | -    | -      |        267 | -    | -                  |
    | 5   | INT  | 3x30m | 5m   | -      |          - | 15m  | inbetween set diff |
    | -   | -    | -     | -    | 2x15m  |        227 | 1m   | constant           |
    #+TBLFM: @4$6=$currentFTP * 1.2;%.0f
    #+TBLFM: @8$5=$currentFTP * 1.08;%.0f
    #+TBLFM: @11$6=$currentFTP * 0.95;%.0f
    #+TBLFM: @6$6=$currentFTP*1.169;%.0f
    #+TBLFM: @11$6=$currentFTP * .95;%.0f
    #+TBLFM: @12$6=$currentFTP * .975;%.0f
    #+TBLFM: @13$6=$currentFTP * 1.00;%.0f
    #+TBLFM: @14$6=$currentFTP * 1.00;%.0f
    #+TBLFM: @16$6=$currentFTP * .85;%.0f

*** Week 2

    | Day | Type | Set   | Target | Rest | SubSet      | SubSet Ins | Rest | Instruction |
    |-----+------+-------+--------+------+-------------+------------+------+-------------|
    |   0 | INT  | 3     | -      | 5m   | 3x2.5m      | 252        | 4m   | Constant    |
    |   1 | UDF  | -     | -      | -    | -           | -          | -    | 90m         |
    |   2 | INT  | 6x7m  | 223    | 7m   | -           | -          | -    | -           |
    |   3 | UDF  | -     | -      | -    | -           | -          | -    | 60m         |
    |   4 | INT  | 3     | -      | 10m  | 5x(1+1+1+1) | -          | -    | -           |
    |   - | -    | -     | -      | -    | -           | 200        | -    | -           |
    |   - | -    | -     | -      | -    | -           | 205        | -    | -           |
    |   - | -    | -     | -      | -    | -           | -          | -    | -           |
    |   - | -    | -     | -      | -    | -           | 267        | -    | -           |
    |   5 | INT  | 4x18m | 243    | 7m   | 3x6m        | -          | 1m   | -           |
    #+TBLFM: @2$7=$currentFTP * 1.2;%.0f
    #+TBLFM: @4$4=$currentFTP * 1.06;%.0f
    #+TBLFM: @7$7=$currentFTP * .95;%.0f
    #+TBLFM: @8$7=$currentFTP * .975;%.0f
    #+TBLFM: @9$7=$currentFTP * 1.00;%.0f
    #+TBLFM: @10$7=$currentFTP * 1.00;%.0f
    #+TBLFM: @11$4=$currentFTP * .91;%.0f

**** instantaneous power converted to average power

       A    B

     1.20
     -----
          \
           \
            \
             \
	      1.10

     A 45s
     B 75s
     
     |   x | ratio to FTP | Power |
     |-----+--------------+-------|
     |  45 |        1.200 |   320 |
     |  70 |        1.194 |   319 |
     |  95 |        1.182 |   316 |
     | 120 |        1.169 |   312 |
     #+TBLFM: $2= (-$1^2 + 1890 $1 - 2025)/(1500 $1);%.3f
     #+TBLFM: $3= $2 * $currentFTP;%.0f


      A  B  C   D

           1.05
           ____
          /    \
         /      \
     ---/        \
     .95

     A,B,C,D: 60s

     B:

     |   x | ratio to FTP | Power |
     |-----+--------------+-------|
     |  60 |        0.950 |   254 |
     |  80 |        0.954 |   255 |
     | 100 |        0.963 |   257 |
     | 120 |        0.975 |   260 |
     #+TBLFM: $2= ($1^2 + 1020 $1 + 3600)/(1200 $1) ;%.3f
     #+TBLFM: $3= $2 * $currentFTP;%.0f
 
     C:

     |   x | ratio to FTP | Power |
     |-----+--------------+-------|
     | 120 |        0.975 |   260 |
     | 180 |        1.000 |   267 |
     #+TBLFM: $2=(1.05 $1 - 9)/$1;%.3f
     #+TBLFM: $3= $2 * $currentFTP;%.0f

     D:

     |   x | ratio to FTP | Power |
     |-----+--------------+-------|
     | 180 |        1.000 |   210 |
     | 240 |        1.000 |   210 |
     #+TBLFM: $3= $2 * $currentFTP;%.0f

*** Week 3

    Rest week. No intense workout.

*** Week 4

    | Day | Type | Set   | Target | Rest | SubSet  | SubSet Ins | Rest | Instruction   |
    |-----+------+-------+--------+------+---------+------------+------+---------------|
    |   0 | FTP  | -     | -      | -    | -       | -          | -    | -             |
    |   1 | UDF  | -     | -      | -    | -       | -          | -    | 90m           |
    |   2 | INT  | 4x9m  | 220    | 7m   | -       | -          | -    | -             |
    |   3 | UDF  | -     | -      | -    | -       | -          | -    | 90m           |
    |   4 | INT  | 6x10m | 264    | 5m   | -       | -          | -    | try your best |
    |   5 | INT  | 3x30m | 227    | 5m   | 15+1+15 | -          | 1m   | -             |
    #+TBLFM: @4$4=$currentFTP * 1.05;%.0f
    #+TBLFM: @6$4=$currentFTP * 0.99;%.0f
    #+TBLFM: @7$4=$currentFTP * 0.85;%.0f

*** Week 5

    | Day | Type | Set   | Target | Rest | SubSet | SubSet Ins | Rest | Instruction |
    |-----+------+-------+--------+------+--------+------------+------+-------------|
    |   0 | INT  | 3     | -      | 8m   | 3x3m   | 248        | 5m   | VO2MAX      |
    |   - | -    | -     | -      | -    | -      | 307        | -    | -           |
    |   - | -    | -     | -      | -    | -      | 299        | -    | -           |
    |   1 | UDF  | -     | -      | -    | -      | -          | -    | 90m         |
    |   2 | INT  | 5x8m  | 280    | 8m   | -      | -          | -    | Constant    |
    |   3 | UDF  | -     | -      | -    | -      | -          | -    | 60m         |
    |   4 | INT  | 5x12m | 264    | 5m   | -      | -          | -    | Constant    |
    |   5 | INT  | 4x18m | 246    | 7m   | 3x6m   | -          | 2m   | Constant    |
    #+TBLFM: @2$7=$currentFTP * 1.18;%.0f
    #+TBLFM: @3$7=$currentFTP * 1.15;%.0f
    #+TBLFM: @4$7=$currentFTP * 1.12;%.0f
    #+TBLFM: @6$4=$currentFTP * 1.05;%.0f
    #+TBLFM: @8$4=$currentFTP * .99;%.0f
    #+TBLFM: @9$4=$currentFTP * .92;%.0f

*** Week 6

    | Day | Type | Set   | Target | Rest | SubSet | SubSet Ins | Rest | Instruction |
    |-----+------+-------+--------+------+--------+------------+------+-------------|
    |   0 | INT  | 2     | -      | 4m   | 3x2m   | 262        | 2m   | VO2MAX      |
    |   1 | UDF  | -     | -      | -    | -      | -          | -    | 90m         |
    |   2 | INT  | 4x10m | 220    | 8m   | -      | -          | -    | Constant    |
    |   3 | UDF  | -     | -      | -    | -      | -          | -    | 60m         |
    |   4 | INT  | 4x15m | 208    | 10m  | -      | -          | -    | Constant    |
    |   5 | INT  | 4x20m | 200    | 5m   | -      | -          | -    | Constant    |
    #+TBLFM: @2$7=$currentFTP * 1.25;%.0f
    #+TBLFM: @4$4=$currentFTP * 1.05;%.0f
    #+TBLFM: @6$4=$currentFTP * .99;%.0f
    #+TBLFM: @7$4=$currentFTP * .95;%.0f

*** Week 7

    Recover week. No intense training. Just do smelling-nice-flowers ridings.

*** dead-hard-extension

    | Day | Type | Set   | Target | Rest | SubSet | SubSet Ins | Rest | Instruction    |
    |-----+------+-------+--------+------+--------+------------+------+----------------|
    |   1 | INT  | 3     |      - | 5m   | 3x3m   | 334        | 3m   | VO2MAX         |
    |   2 | INT  | 5x8m  |    280 | 8m   | -      | -          | -    | Suprathreshold |
    |   3 | INT  | 4x10m |    254 | 8m   | -      | -          | -    | Sweet Spot     |
    |   4 | INT  | 3     |      - | 5m   | 3x2m   | 334        | 2m   | VO2MAX         |
    |   5 | INT  | 8x6m  |    280 | 6m   | -      | -          | -    | Suprathreshold |
    |   6 | INT  | 4x20m |    248 | 10m  | -      | -          | -    | Sweet Spot     |
    #+TBLFM: @2$7=$currentFTP * 1.25;%.0f
    #+TBLFM: @3$4=$currentFTP * 1.05;%.0f
    #+TBLFM: @4$4=$currentFTP * .95;%.0f
    #+TBLFM: @5$7=$currentFTP * 1.25;%.0f
    #+TBLFM: @6$4=$currentFTP * 1.05;%.0f
    #+TBLFM: @7$4=$currentFTP * .93;%.0f


** FTP test
*** test matrix
   
    | set         | time | Power |
    |-------------+------+-------|
    | 0 warm-up   | 10 m |   160 |
    | 1 wapr-up+  | 5 m  |     - |
    | --> 1.1     | 1 m  |   267 |
    | --> 1.2     | 1 m  |   130 |
    | --> 1.3     | 1 m  |   275 |
    | --> 1.4     | 1 m  |   130 |
    | --> 1.5     | 1 m  |   287 |
    | 2 rest      | 5 m  |     - |
    | 3 de-       | 5 m  |   294 |
    | 4 rest      | 5 m  |     - |
    | 5 test      | 20 m |     - |
    | 6 cool down | 5 m  |     - |
    #+TBLFM: @2$3=$oldFTP * .6;%.0f
    #+TBLFM: @4$3=$oldFTP;%.0f
    #+TBLFM: @5$3=130;%.0f
    #+TBLFM: @7$3=130;%.0f
    #+TBLFM: @8$3=$oldFTP + 20;%.0f
    #+TBLFM: @10$3=$oldFTP * 1.1;%.0f

** problem solved

   Fang Mountain +3, i.e. Week 0 Day 4

          1.1
         /\
        /  \
   ----/    \

   .95       .95
   
   Each of the sub-set consists 3 subsections. In subsection, it is a
   3 minutes period. However, the power is not a constant during this
   period. Another issue is that the power meter shows the average
   power, so a conversion must be applied.

   - use interval timer to record 3 mins as a whole

     The best method is to tell the user for the next 20 second,
     what is the target power.

*** solution to this tri issue


         /
   -----/- 
   ----/ | 

    At the end of the first part power goes up:

    ( the average power from the begining of power ) * 2
    
       = ( power difference between the top and the bottom ) * 1 * 1/2 
   
    Using the area priciple, i.e. the area of triangle equals to the
    rectangle.

    So the power target at the end of that peak should be:

    target power = ( 1.1 - 0.95 ) * .95 / 4

    This will tell the user that s/he should put the target power for
    next 20 seconds. So, s/he would have 3 check points during the
    power surge.

    Therefore, the following section, i.e. the power down-ward period,
    the user should have a target number:

    target power = ( 1.1 - 0.95 ) * .95 / 3

*** tools
    - math https://www.wolframalpha.com/input/?i=1%2B1&wal=header
